[
    {
        "source": "educationusa_student_visa_faq.txt",
        "content": "Jump to navigation\nYou've now reached Step 4! Applying for your U.S. student visa. This next step will cover F, J and M student visa types.\nInformation pertaining to visas and travel can be found on the U.S. Department of State'sBureau of Consular Affairs websiteand the U.S. Department of Homeland Security'sStudy in the States.\nChoose your level of study to learn more about applying for your student visa.\n\n\nBecause visa interviews are short, do your best to explain why you want to study in the United States, how you plan to support yourself while in school, and what your plans are for when your studies are finished.\nFind an advising center\nEducationUSA is committed to promoting the diversity of U.S. higher education to help international students find their best fit."
    },
    {
        "source": "dol_h1b_overview.txt",
        "content": "An official website of the United States government.\nHere’s how you know\nThe .gov means it’s official.Federal government websites often end in .gov or .mil. Before sharing sensitive information, make sure you’re on a federal government site.\nThe site is secure.Thehttps://ensures that you are connecting to the official website and that any information you provide is encrypted and transmitted securely.\nBack\nBack\nBack\nBack\nBack\n\nThe H-1B program applies to employers seeking to hire nonimmigrant aliens as workers in specialty occupations or as fashion models of distinguished merit and ability. A specialty occupation is one that requires the application of a body of highly specialized knowledge and the attainment of at least a bachelor’s degree or its equivalent. The intent of the H-1B provisions is to help employers who cannot otherwise obtain needed business skills and abilities from the U.S. workforce by authorizing the temporary employment of qualified individuals who are not otherwise authorized to work in the United States.\nThe law establishes certain standards in order to protect similarly employed U.S. workers from being adversely affected by the employment of the nonimmigrant workers, as well as to protect the H-1B nonimmigrant workers. Employers must attest to the Department of Labor that they will pay wages to the H-1B nonimmigrant workers that are at least equal to the actual wage paid by the employer to other workers with similar experience and qualifications for the job in question, or the prevailing wage for the occupation in the area of intended employment – whichever is greater.\nOn January 15, 2021, the U.S. Department of Labor (Department) issued an Office of Foreign Labor Certification H-1B Program Bulletin and a Wage and Hour Division Field Assistance Bulletin (FAB) revising its interpretation of its regulations concerning which employers of H-1B workers must file Labor Condition Applications.  The Department simultaneously submitted a Notice for publication in the Federal Register announcing and requesting public comments on this interpretation.  On January 20, 2021, the Department withdrew its Notice from the Office of the Federal Register prior to its publication, and is now withdrawing the Bulletin and FAB for the purpose of considering the process for issuing this interpretation as well as reviewing related issues of law, fact, and policy.  Accordingly, the requirements of the Bulletin and FAB are no longer in effect.  The Department will notify the public of any further actions as appropriate once it completes its review.\n\n\nAn agency within the U.S. Department of Labor\n200 Constitution Ave NWWashington, DC 202101-866-4-US-WAGE1-866-487-9243\nConnect With DOL"
    },
    {
        "source": "uscis_f1_visa.txt",
        "content": "If you would like to study as a full-time student in the United States, you will generally need a student visa. There are two nonimmigrant visa categories for persons wishing to study in the United States. These visas are commonly known as the F and M visas.\nYou may enter in the F-1 or M-1 visa category provided you meet the following criteria:\nThe F-1 Visa (Academic Student) allows you to enter the United States as a full-time student at an accredited college, university, seminary, conservatory, academic high school, elementary school, or other academic institution or in a language training program. You must be enrolled in a program or course of study that culminates in a degree, diploma, or certificate and your school must be authorized by the U.S. government to accept international students.\nThe M-1 visa (Vocational Student) category includes students in vocational or other nonacademic programs, other than language training.\nF-1 students may not work off-campus during the first academic year, but may accept on-campus employment subject to certain conditions and restrictions. After the first academic year, F-1 students may engage in three types of off-campus employment:\nF-1 students may also be eligible to work off-campus on a case-by-case basis as a result ofspecial situationssuch as severe economic hardship or special student relief. M-1 students may engage in practical training only after they have completed their studies.\nFor both F-1 and M-1 students any off-campus training employment must be related to their area of study and must be authorized prior to starting any work by the Designated School Official (the person authorized to maintain the Student and Exchange Visitor Information System (SEVIS)) and USCIS.\nIn general, only noncitizens who have permission from DHS to work can apply for a Social Security number.\nIf you are interested in changing to F or M Student Status, see theChanging to a Nonimmigrant F or M Student Statuspage.\nFor more information on the nonimmigrant student (F and M) classifications, see theUSCIS Policy Manual.\nFor more information on the residence abroad requirement, see 9 FAM 402.5-5(E)(1) of theU.S. Department of State Foreign Affairs Manual.\nFor more information on the Student and Exchange Visitors Program, see theStudent & Exchange Visitor Program, Immigration & Customs Enforcementand theStudy in the States Training Opportunities in the United Statespages.\nFor more information onInternational Students and Social Security Numbers  (PDF), see theSocial Security Administrationwebsite.\nUSCIS.gov\nAn official website of theU.S. Department of Homeland Security"
    },
    {
        "source": "shorelight_student_visa.txt",
        "content": "Get ready to study abroad in America with our step-by-step guide to F-1 visa rules.â¨\nStudents wishing to study in the United States need to learn about the F-1 student visa application process. There are more than one million international students currently studying abroad in the USA, and with some preparation and guidance, you can join them. To help you get started, we have put together this step-by-step guide to US visas to help you understand what is a F-1 visa, F-1 visa rules, and F-1 visa requirements.\n\nThe F-1 student visa is a non-immigrant visa that allows international students to enter the US and study at institutions certified by the Student and Exchange Visitor Program (SEVP). It is the most popular type of student visa for students seeking to study at a US university or college, and you can only apply for your F-1 visa after an accredited US institution accepts your application.\nAs a F-1 student, the duration of your stay will vary based on the program in which you enroll. TheI-20 formprovided by the university you wish to attend will list the expiration date of your program. You will need to earn your degree before the listed expiration date, and this will give you an outline of how long you will be able to remain in the US.\n\nFollowing your graduation, you may be eligible to apply forOptional Practical Training (OPT). This will permit you to work for up to 12 months in the US in a field related to your study. For STEM graduates, you can request two additional years of work in a related field. If you do not have any extensions or additional training, you will need to return to your home country within 60 days after your graduation. If you want to learn more, Shorelight can help you explore what you can do with yourF-1 visa after graduation.\nHave questions about the student visa process? Attend anupcoming Shorelight webinar>\nThere are several F-1 visa rules to keep in mind if you plan to apply for a F-1 student visa. You must meet these requirements for your application to be accepted:\nInstitution certificationâThe college or the university where you plan to study needs to be approved by SEVP Immigration & Customs Enforcement.\nFull-time enrollmentâYou must be enrolled as a full-time student at the institution while your academic term is in session.\nEnglish language proficiencyâYou must meet the required English language proficiency score of the institution you are attending or be enrolled in courses that will help you improve your English proficiency.\nSufficient fundingâYou must prove you have sufficient funds available to finance your studies and living expenses while in the US.\nValid passportâYour passport should be valid for US travel for at least six months after your program completion date.\nHome country residencyâYou are required to have a residence in your home country to return to following the completion of your degree.\n\nBefore you begin your F-1 visa application, you must take the following steps:\nGet accepted by a SEVP-certified institution before submitting your visa application. When you are accepted, you will receive your I-20 form, which you will need to apply for your F-1 visa.\nPay your SEVIS fee.\nComplete your DS-160 visa application.\nSchedule your visa interview.\nAttend your visa interview.\nIf you are applying for a F-1 visa from India, ShorelightâsF-1 visa for Indian studentsguide is for you.\nOnce these steps are completed, you will be ready to complete and submit your F-1 student visa application.\n1. Get Accepted and Get Your I-20\nThe F-1 student visa process starts when you get accepted to a SEVP-certified US university. SEVP certification is the US governmentâs way of proving that your university is accredited and has the proper resources to provide you with an education.Â\nOnce you are accepted, your university will provide your I-20 form. This form documents your study plans and provides supporting information about your stay.Â\nThe following information is recorded in the Student and Exchange Visitor Information System (SEVIS) when your I-20 is issued:\nYour SEVIS ID number\nYour program start and end dates\nYour intended program of study\nYour funding sources\nCost of attendance at your school of choice\nOther personal information\nYour university provides this information based off what you submit in your university application materials.Â\nAs soon as you receive your I-20, make sure all your information is accurate, and then sign the bottom of the first page. It can take a long time to fix an error on your I-20 and if something is wrong, you may not be granted access into the country. Retain your form I-20 when you travel to the US. You will need it to enter the US, to work, and for other activities (e.g., likegetting a US driverâs license).Â\nHelpful resources:Confirm your US university is aSEVP-accredited institutionÂ\nKeep your Shorelight enrollment advisor updated through every step of the visa process â when you submit your application, schedule your visa interview, and, of course, when your visa application is approved.\n2. Pay Your SEVIS Fee\nThe total cost for your F-1 student visa will be approximately $535, which includes the cost of the visa itself, plus SEVIS processing and maintenance fees.Â\nRequirements:Your I-20\nCost:$350Â\nWhere to apply:Payment portalfor your SEVIS fee\nMake sure to save the I-901 SEVIS fee receipt. You will need it for your visa interview.Â\n3. Complete Your DS-160 Visa Application\nYourDS-160is your visa application. All prospective international students must complete a DS-160 to receive an F-1 visa.Â\nRequirements:Your I-20, passport, travel itinerary, photo for your visa\nCost:$185Â\nWhere to apply:Application portalfor your DS-160\nAfter you successfully submit your DS-160, you will receive a printed confirmation with a barcode on it. Save this form â you will need it for your visa interview.Â\n4. Schedule Your Visa Interview\nFind thenearest US embassy or consulateand schedule your visa interview. Wait times will vary by country and can take months â so remember to set up your appointments as early as possible!\nIf you are enrolling at a US university through Shorelight, ask your enrollment advisor about student visa interview tips or how to set up a mock interview session. Practicing your visa interview in advance will make you feel more comfortable with the process.\nAsk your Shorelight advisor to set up a mock visa interview for you.\n5. Attend Your Visa Interview\nDuring the interview portion of the F-1 visa application process, the US consulate or embassy confirms you are coming to study as a legitimate, serious student. In your visa interview, you must also prove you have the funds to cover your time studying in the US, and confirm that you plan on returning home after your studies are complete. Attending your visa interview in person is required, though there are a few rare exceptions (e.g., if you are younger than 14 or older than 80 years of age, or if you meet certain visa renewal requirements).Â\nCost:Your DS-160 payment covers the cost\nWhere to apply:Scheduling portalfor your visa interview\nAfter you successfully complete your visa interview, you will be granted your F-1 visa and acquire F-1 status. You are now cleared to study in the USA!Â\nRefer toTravel.state.govto learn more. If you need any help with preparing or submitting your application, Shorelight providesapplication assistance for international students.\nBefore you attend your visa interview, make sure to have the following documents ready for evaluation by the consular officer:\nA valid passport\nA copy of the photo you will use for your visa\nPrinted copies of your DS-160 and I-901 SEVIS payment confirmations\nI-20 form\nSchool transcript and official test scores cited on your university application\nDiploma and other certificates (if applicable)\nBank statements or other proof of finances\nDuring your interview, the consular officer may request additional documents. To prepare, consider bringing the following documents:\nAcademic records such as transcripts, diplomas, degrees, or certificates from schools you attended\nStandardized test scores required by your US institution\nEvidence of your intent to depart the United States upon completion of your course of study\nStatements proving your ability to pay all educational, living, and travel costs\nAs an international student, you might feel uncertain about your upcoming interview. While feeling nervous is normal, do not forget to take a deep breath and remember that you are well prepared! Your interview is important, but should not be stressful.\nYour interviewer will ask questions to determine:Â\nAre you a legitimate student?\nDo you have the resources to pay for your studies?\nDo you plan to return home after completing your degree?\nTo prepare for your F-1 student visa interview, here are some questions you might be asked:Â\nWhy did you pick this university?\nWhich other US universities did you apply to?\nHow will you pay for your education?\nDo you have relatives in the USA?\nDo you plan to work while in the USA?\nWhat do you plan to do after graduation?\nYour Shorelight advisor can help you prepare for your interview by giving you a detailed overview of what the process will involve. They can also help you practice with mock interviews! ShorelightâsF-1 student visa interview guidecan also help you learn more about what you can do to prepare for your upcoming interview.Â\nThere is a possibility that your F-1 visa application will be denied. If this happens, you will be given detailed reasoning in writing, including the section of the law that led to the denial of your application. Â\nTo avoid having your F-1 student visa application denied, it is important to read and follow all instructions carefully. Always double- and triple-check your documents before submitting your application. Shorelight advisors can offervisa assistanceto make this process easier for you: They are happy to help you organize all the documents you will need, in the correct formats, and on schedule.Â\nRemember: During your F-1 student visa interview, you want to sufficiently demonstrate that you are traveling to the US to study and planning to return to your home country once your program is complete. Keep this in mind as you answer your interview questions.\nAs an international student, you must actively maintain your F-1 status to continue studying in the US. To do this, you must comply with both university regulations and codes of conduct, as well as with the requirements and conditions set out in your F-1 visa requirements.Â\nWhen entering the US:\nMake sure to enter the US no more than 30 days before your program begins.\nAs soon as you arrive in the country, contact your designated school official (DSO).\nWhen you arrive at your university, contact your DSO again before the start date listed on your I-20 form.\nWhile studying in the US:\nAttend all your classes and maintain good academic standing. If you require support with any of your classes, your Shorelight advisor can direct you toacademic resourcesto help you improve.\nIf you need extra time to complete your program which would exceed the end date specified in your I-20, speak with your DSO to discuss your options for possible extensions.\nMake sure to enroll for a full course of study when your academic term is in session.\nIf you want to drop a class or change classes, make sure to speak to your DSO first.\nIf you want to take a break and/or go on vacation, remember to first complete at least one full academic year at your institution.Â  After your holiday, you must also register for classes in the next academic term.\nYes, you will be able to work in the US on a F-1 student visa. However, you will have to follow certain F-1 visa rules and restrictions:\nYou can only work part time on campus while your academic term is in session\nYou can only work a maximum of 20 hours per week\nYou may be able to work off campus with the approval of your university\nDuring academic breaks, you will be permitted to work full time, if your university allows it. You can learn more about working as a F-1 international student by referring toUSCIS.gov.\nWhen searching for work while you study, make sure to seek approval from your DSO first.Â\nKeep in mind, once you finish your program, you will have a grace period of 60 days to leave the US. If you wish to extend your stay, you can speak to a Shorelight advisor to explore your options, such astransferring to another schoolor pursuing further education. You can also refer to ShorelightâsF-1 extension guideto have a look at your options.\nNow that you know how US non-immigrant visas work for international students, create a checklist of next steps and get started. The sooner you begin fulfilling the USA study visa requirements, the better chance you will have of securing your spot at an American university.Â\nHow can we help? Talk to an advisor today about applying to aShorelight university>"
    },
    {
        "source": "ashoori_law_h1b.txt",
        "content": "The H1B Visa is a great option for foreign nationals seeking to work in the United States with a valid job offer. In this guide I will discuss what you need to know the H1B visa.\n\nIf you have any questions about the H1B visa, feel free to email me directly atMichael@AshooriLaw.com. I’m very responsive via email and would be happy to answer your questions.\n\n\nThe H1B is a special visa that allows foreign nationals to enter the United States to perform “specialty occupations.” A specialty occupation is one that requires, at minimum, a bachelor’s degree or enough work experience that could equate a degree.\n\n\n\n\nThe H1B is a special visa that allows foreign nationals to perform specialty occupations in the United States. This work can be in - but is not limited to - any of the following fields:\n\n\nIf an argument exists that the position requires a bachelor’s degree, then you may be eligible for an H1B. The work can be either full-time or part-time. Every year, there are 65,000 H1B visas made available. An additional 20,000 H1Bs exist for those with advanced degrees (masters, juris doctor, etc.) from US institutions.\n\nH1B visas  are valid for up to three years. Furthermore, three-year extensions are available, for a total validity period of six years. Those on an H1B are eligible to bring their dependent spouse and children. These dependents would hold H4 status.\nH1B visa holders are eligible to change employers. But they must meet certain requirements. H1B beneficiaries may also pursue permanent immigration status. This is because it is a dual intent visa.\n\n\nThere are many benefits to having an H1B visa. Here are just a few:\n\nThe H1B allows foreign nationals to perform specialty occupations in the United States. This allows highly qualified individuals to work and live in the US. This benefits both the beneficiaries and the US economy.\n\nThe H1B is a nonimmigrant visa. However, unlike the B, H2B, H3 and J1 visas, you only need to show “temporary entry.” As opposed to showing nonimmigrant intent. You must prove you will depart following the termination of H1B status. Although, you are not required to maintain a residence abroad. This means that while you are in H1B status, you can apply for benefits that could lead to a green card - without harming your visa.\n\nYour spouse and dependent children (who are under 21 and unmarried) are eligible forH4status. This means they can come to the United States with you. Those with H4 status may attend school, but are ineligible to work (subject to certain exceptions). Additionally, those with H4 status must be in the United States to join the principal worker. H4 status will be revoked if the visa holders are in the US while the principal H1B holder is usually absent abroad.\n\nOne big advantage of H1B visa is the portability benefits.  This means that if you are on an H1B and change employers, you can begin working for a different employer upon filing your new petition.\n\n\nThere are many conditions to meet for an H1B visa. Animmigration lawyercan help you determine if you meet these provisions. Our office can also help you organize evidence to prove eligibility. Please be aware that those working on an H1B could be subject to random site checks. This is to ensure the information provided to the US government was correct.\n\nThe employer must extend a bona fide job offer to the beneficiary. This can be through a written contract or, if there is no written contract, through a summary of an oral agreement. Additionally, there must be evidence to support the need for the beneficiary.\n\nThis is an important and mandatory condition. For valid employer-employee relationship, there must be employer control. Control is the ability of the petitioner to determine when, where, and how the beneficiary completes his/her duties. USCIS will deny a petition if the beneficiary will not be an employee or report to the petitioner.\n\nUSCIS will examine the following factors to determine if there is a valid employer-employee relationship:\n\n- if the petitioner supplies tools or other instruments to the beneficiary,\n- if the petitioner can hire, pay, and fire the beneficiary,\n- if the petitioner evaluates the beneficiary’s work,\n- if the petitioner provides any employee benefits to the beneficiary,\n- and if the beneficiary appears on the petitioner’s tax information.\n\nIt is difficult to support an employer-employee relationship when the beneficiary is off-site. Yet, a valid relationship can exist if the petitioner controls the beneficiary’s work schedule and has regular contact. A contract or other document detailing the terms and conditions of the job may show an employee-employer relationship.\n\nUSCIS will deny the petition if there is a strike or other labor dispute at the beneficiary's worksite. Although, if the petition has already been approved, the process will be suspended, and you will be unable to come to the US.\n\nA specialty occupation requires theoretical or practical knowledge of a field. To learn whether your job qualifies as a specialty occupation, you should reference:\n\n- The Department of Labor’s Occupational Outlook Handbook (OOH),\n- The Department of Labor’s O*NET online system,\n- and/or the Department of Labor’s Dictionary of Occupational Titles.\n\nThe emphasis is not on the job title, but on the job duties of the individual applicant. Here, the job description will be carefully analyzed. This includes the specific tasks, demands, duties, and actual requirements of the position.\n\nOther factors to determine if the job is a specialty position would be:\n\n- the beneficiary’s education and work experience,\n- the nature of the petitioner’s business,\n- the industry standards,\n- salary (both of the beneficiary and the industry standard),\n- and the business size.\n\nAdditional factors could be:\n\n- work from previous employees in the same position\n- and the job listings for the same or similar positions in the past.\nPositions with the same title can result in different adjudications from USCIS. This is because of USCIS’ focus on the job description and duties.\nThe job must require a bachelor’s degree (or higher) in a specific field of study related to the occupation. Not all foreign degrees titled “bachelor’s degree” are equivalent to a US institution’s bachelor’s degree.\n\nUSCIS may require a credentials evaluation of your foreign transcript and degree. This can help provide evidence that you meet the H1B bachelor’s requirement. The most popular credentials evaluator is the American Association of Collegiate Registrars and Admissions Officers Electronic Database for Global Education (AACRAO EDGE). It may be useful to highlight the relevant coursework in your transcript and tie it to the petitioner support letter.\n\nEXCEPTIONS:\nIf you do not have the academic requirements standard for the job, you can still qualify for an H1B. This can be done through a combination of education, training, and work experience. Here, a petitioner would need to demonstrate the previous experience is equivalent to the standard degree.\n\nYour previous work must include the theoretical and practical application of specialized knowledge. Evidence to support this can include:\n\n- recognition from leaders in your field,\n- published material by or about you,\n- evidence of licensure,\n- evidence of significant contribution to the field,\n- results from CLEP or PONSI,\n- and/or membership in a professional association.\n\nThe required experience depends on the degree traditionally used for the position. If the required degree for the position is a doctoral degree, you must have a doctorate. For example, if a master’s or advanced degree is traditionally used - then a bachelor’s degree with five years of experience in relevant positions may be considered equivalent. If a bachelor’s degree is required, three years of relevant work experience may count for one year of education.\n\nFor an H1B petition, the employer must pay all relevant fees. Provide the reasoning in your cover letter if a designated fee is not required.\n\nIf the position requires a license: the beneficiary must be licensed prior to the H1B approval. If not, provide evidence demonstrating a technical problem for the delay. Note that restricted licenses are only valid for one year or until the license expires, whichever is longer. An approval cannot exceed the validity period of a temporary license.\n\nThere are only two exceptions to this rule:\n\nThose in healthcare professions should be aware that state guidelines supersede OOH requirements. Those primarily involved in research or teaching (not patient care) do not need a license. Additionally, some other exceptions may exist for those in healthcare professions.\n\nNote that having a license does not equate a specialty occupation. For example, nursing requires a license and is not considered a specialty occupation. Additionally, not all specialty occupations require a license. You will not be discriminated against for not having a license if it is not required for your position.\n\n\nOne thing you should be aware of is the numerical limitation on H1B visas. Every year, 65,000 H1Bs are made available, with an additional 20,000 visas reserved for those with advanced degrees.\n\nAny petition not chosen in the lottery or registered after the final receipt date will be rejected. Furthermore, any petition missing mandatory documents and/or fees will be rejected as well. This means that it is critical to be on top of your H1B visa application process. An immigration lawyer can help ensure that you maximize your likelihood for success.\n\nDue to the lottery, many qualified applicants may never be reviewed. Reform has been pushed to change this process. Some advocates believe H1Bs should be reserved for the highest-paid or the most-skilled beneficiaries. Yet, this has not been implemented and the lottery system is our current process.\n\nToday, we have a special lottery system for the advanced degree petitions, held before the regular lottery. If a beneficiary with an advanced degree is not chosen in the first lottery (20,000 designated spots), a second chance will be given in the general lottery.\n\nIt is important to note that H1B1 visa holders (discussed below) are not counted toward the H1B visa cap. The H1B1 has its own numerical limitations: 1,400 for Chilean citizens and 5,400 for citizens of Singapore. Furthermore, H4 dependents are not count towards this quota.\n\nFinally, it is important to note that there are some exceptions. Employees for the listed organizations are not counted toward the cap on H1B visas. These organizations are also not subject to the ACWIA fee:\n\n\nA US company will file the petition on behalf of a foreign national who will receive the H1B. The US company is called the petitioner. The foreign national is called the beneficiary.\n\nA petitioner must:\n\n\nPetitioners can only file one petition per beneficiary in any given calendar year. If a petitioner submits more than one application, the petition or visa will be denied or revoked. The only exception to this is if the petitioner receives notice of a delay on the first filing. In this case, the petitioner can send a second petition with an explanation and withdraw the first.\n\nHowever, multiple companies in the same corporate family can submit a petition for the same beneficiary. Here, each entity must have their own Federal Employer Identification Number. Additionally, they must have their own legitimate need to hire that beneficiary.\n\nIt may also be possible to have an agent file an H1B petition. This person acts on behalf of the petitioner. An agent can file on behalf of multiple employers if the beneficiary will work with more than one entity. Note that if an agent files the petition, all requirements must still be met.\n\nAnimmigration lawyer, including myself or a member of my team, would be happy to assist with your H1B filing.\n\n\nThe H1-B visa is a multistep process. The following is a general guideline followed by a more detailed explanation:\n\n\nIn winter 2019, DHS implemented the H1B CAP electronic registration rule. This applies to all employers applying for an H1B petition on behalf of any potential future H1B employees. Note that this registration rule also includes the advanced degree applicants.\n\nFor all H1B cap-subject petitions, a separate registration application is required. This must be done for each potential worker. If the electronic registration application is selected, petitioners can then submit Form I-129. Previously, petitioners had to be submit the I-129 every year, even without knowing whether their petition was chosen.\n\nDHS will require a payment of $10 for each electronic registration, which is due and payable at the time of the registration submission. A registration will not be considered submitted unless the fee is rendered.\n\nRemember, you should submit two copies of your H1B petition. You must mail your application to the appropriate USCIS Service Center. One should be the original and the second, a copy, for consular processing. The appropriate USCIS delivery address will vary. Please go on USCIS.GOV and check the filing location based on your employment details. An immigration lawyer can assist you in determining where your petition should be mailed.\n\nAs discussed in Section 4: “Numerical Limitations,” it is crucial you submit your petition no later than April 1st. Please note that the petition is considered received when it arrives at the Service Center. All petitions received on the same day will be treated equally. If you are you chosen, keep in mind the requirements for keeping your status and filing your renewal. H1B extensions cannot be filed more than six months before the status expiration date. Thus, it is recommended that you begin preparing as early as possible.\n\nTo file for your H1B visa, here are some of the documents that you may need:\n\n\n\n\nWhen your petition is approved, you will receive an approval notice via Form I-797.\n\nIf USCIS is satisfied with the submitted petition, it will be processed for approval. If the government is unable to deliberate an approval, they can send a Request for Evidence (RFE). This states what terms of the H1B application was unmet and why USCIS is unable to render an approval. Here, the petitioner can provide additional evidence to help support their filing.\n\nUSCIS may also send a Notice of Intent to Revoke or Deny (NOIR/NOID), which must be responded to within the given deadline. Failure to respond to either document or failure to provide adequate evidence in the response will mean the petition is rejected.\n\nHowever, if the new evidence allows USCIS to determine all conditions for an H1B visa are satisfied, a Form I-797 with approval of an H1B petition, will be rendered. Approved H1B petitions are valid for up to three years or through the validity period of the H1B petition, whichever is shorter. Please be aware that an H1B petition can be revoked if any of the facts listed in the petition substantially change or were fraudulently stated.\nUpon receiving the approval, the foreign national can schedule an appointment at a US consulate. Note that you cannot apply for a visa more than 90 days before the start date of the job. Upon scheduling a consular interview, the foreign national will meet with a US consular officer and show them their I-797 approval.\n\nSince the conditions for a H1B visa were determined to have been met with the approval of the petition, the focus of the interview would be o the individual’s eligibility. The beneficiary should bring a copy of the petition and evidence of his/her specific qualifications. Different consulates and individual situations require different forms. Additionally, please be aware that visas do not have to be issued for the full length of the petition’s validity. You will need to check the visa reciprocity schedule with the Dept. of State to see how long your visa stamp will be valid for.\n\nH-1B beneficiaries may arrive in the United States up to 10 days before the start date of their petition and stay up to 60 days (with some exceptions) after the termination of their H1B status. Upon arrival, you should present your passport, H1B visa, and Form I-797 approval. You should ensure you receive an I-94 card with accurate information. You should take care to note expiration dates for your status.\n\nMany documents are required during the H1B visa application process. The following is a general list. Please be aware this is not a comprehensive list and the documents you will need will vary based on your individual case:\n\n\n\nThe following fees are paid for by the US employer or their representative. Yet, there may be other costs associated with the H1B visa application process. These include translations, photocopying fees, or transportation, which can be paid by the beneficiary. Please be aware that all fees listed in this guide are subject to change.\n\n\n\nThe amount of time it takes between an H1B filing and the receipt of an approval, depends on a wide range of factors. These factors include:\n\n- whether premium processing was elected,\n- which type of H1B visa you are requesting (cap-exempt, advanced degree, regular),\n- which USCIS Service Center you use,\n- and which US consulate you are being stamped at (if you are abroad).\n\nThus, the processing can take anywhere from less than two months to more than nine months.\n\nAdditionally, regardless of approval date, beneficiaries will not be eligible to work until the October 1stfollowing the lottery.\n\n\nOnce a beneficiary begins working in the United States on an H1B, there are still several things you should note. If the beneficiary changes employers or 50% of their job duties, an amended of new petition must be filed.\n\nIf there is a change in worksite, a new labor condition application must also be submitted. If the job ends unexpectedly, the beneficiary may stay for up to 60 days or until the visa expires, whichever is shorter. During this time, the beneficiary may attempt to find a new employer to remain in the US but may not work. It is important to note if there are any changes to a beneficiary’s job position or to the US company. Here, an immigration lawyer can help you determine what steps are required to be in compliance with the H1B visa program.\n\nAdditionally, an H1B is valid for a maximum of three years. To stay for up to three additional years, an extension must be filed. The request must be submitted while the beneficiary is still in valid H1B status. The extension does not have to be granted and does not have to be for the full three years. To strengthen the application, submit documentation showing the continued need for the H1B beneficiary. Items including, but not limited to, copies of pay records, work schedules, evaluations, and work produced by the beneficiary can be helpful.\n\n\nAs stated, H1Bs are valid for a period of up to six years. Yet, you should note that time spent in L status counts toward this six-year time period. However, this six year maximum only counts for time physically spent in the United States. If a beneficiary can demonstrate that they spent time outside the United States, that time does not count toward the six-year H1B maximum. This time can be “recaptured” and used towards further extending their H1B time.\n\nFor example, if someone returned to their home country for one week each year for a total of six weeks, this time can be recaptured. Here, the beneficiary would be eligible to spend an additional six weeks in the United States on H1B status. Please note that only full days spent outside of the United States can be recaptured. If any part of the day was spent in the United States such as a travel day, it is not eligible for recapture.\n\n\nWhile on an H1B, you can apply for permanent resident status. Furthermore, those awaiting an immigrant visa priority date may be eligible to stay in the United States on an H1B for longer than six years. You may also be eligible to hold H1B status for longer if you have an approved EB-1, EB-2, and/or EB-3 petition. If you have any questions about the process of going from an H1B visa to permanent resident status in the United States, an immigration lawyer, such as myself or another member of my team, can provide further information.\n\nCitizens of Chile and Singapore are eligible for H1B1 status. H1B1 visas are valid for up to 18 months and can be renewed indefinitely. You can apply either through USCIS or at a US consulate abroad. Those under H1B1 status are not counted toward the 65,000 visa cap and are not subject to the same six year maximum stay as those on the H1B. Some jobs that are not considered specialty occupations and are ineligible for an H1B visa may be accepted under the H1B1 visa. If you believe you may be eligible for an H1B1 visa, an immigration lawyer, like myself or another member of my team, can assist you further.\n\nApplicants for an H1B1 visa can apply directly at the consulate or with USCIS (as a change of status). H1B1 applicants can provide all documentation directly to a consular officer when they seek visa stamping. They need not have an approval before their consular appointment.\n\n\nOur clients commonly change status from an F-1 (student) visa to an H1B. If you have F-1 status, you are eligible for one year of practical training following your education. Those in STEM fields may be able to extend their practical training for an additional 24 months. This practical training must focus on the theoretical application of your specialized field of knowledge. This work must be related to the degree you earned. Employers can file H1B visas for students engaging in practical training who they wish to hire for a longer period of time and who meet all of the requirements outlined herein.\n\nSome foreign nationals who finished practical training, but cannot commence their H1B employment, may be eligible to stay in the United States during this gap. The H1B holder does not have to return to their home country during this period. Although they may not work in the United States during this time. This “cap-gap relief” eliminates the need for inconvenient and expensive travel between the US and another country. If you have any questions about this process, an immigration lawyer, such as myself or another member of my team, would be happy to assist you.\n\nThe H1B visa is one of the most popular avenues that allow foreign nationals to perform specialty occupations in the United States. You should now have a much stronger understanding of the various aspects of the H1B visa, including the H1B visa benefits, requirements, and the visa application process.\n\nIf you have any questions regarding the information discussed in this guide or about the H1B visa generally, feel free to email me directly at Michael@AshooriLaw.com. I am very responsive via email and I would be happy to help you.\nI’m a U.S. immigration lawyer and I help families, professionals, investors, and entrepreneurs get visas, green cards, and citizenship to the United States.\nSince starting my law firm, I’ve helped thousands of people from all over the world with their immigration needs. I’m very passionate, hard-working, and committed to my clients.\nGot a question?Send me an email.\nDISCLAIMER: This article is designed for general information only and is NOT legal advice. The information presented in this article should not be construed to be formal legal advice nor the formation of a lawyer/client relationship. The information presented in this article does not create an attorney-client relationship nor is it a solicitation to offer legal advice. If you need legal advice, you may contact me personally or contact another attorney. You should seek the advice of an attorney in your jurisdiction before taking any legal action. As such, I disclaim all liability with respect to actions taken based on any information presented. The information presented in this article is subject to change. The information presented in the article may have changed since the publication of this article, and may therefore no longer be valid. Nothing herein is intended to nor constitutes a guarantee, warranty, or prediction regarding the outcome of your legal matter. Every case is different and outcomes will vary depending on the unique facts and legal issues of your case. Thank you.\nATTORNEY ADVERTISING: Our website and all of the pages on our website that invite you to contact our law firm directly are attorney advertising.\nAshoori Law | U.S. Immigration Lawyers • © 2024 • All Rights Reserved.Disclaimer.Contact.Scholarship.Start.Applications.Schedule.Referral Partners.\nAshoori Law | U.S. Immigration LawyersAll Rights Reserved © 2024Disclaimer.Contact.Scholarship.Start.Applications.Schedule.Referral Partners."
    },
    {
        "source": "uscis_h1b_visa.txt",
        "content": "We will reject H-1B or H-1B1 (HSC) petitions received at a USCIS service center on or after April 1, 2024. There will beno grace periodprovided.\nBeginning on April 1, 2024, all paper-filed Form I-129 petitions requesting H-1B1 (HSC), or H-1B classification, including those with a concurrent Form I-907, Request for Premium Processing Service, and those with concurrently filed Form I-539 and/or Form I-765, must be filed at a USCIS lockbox facility. If you are filing Form I-129 alone or with Form I-907, you may also file online. On March 25, USCIS launched online filing of Form I-129 and associated Form I-907 for non-cap H-1B petitions. On April 1, USCIS will begin accepting online filing for H-1B cap petitions and associated Forms I-907 for petitioners whose registrations have been selected. You can find the lockbox filing addresses for paper filed forms on ourForm I-129 Direct Filing Addressespage.\nOn Feb. 28, 2024, we launched newUSCIS organizational accountsthat will allow multiple people within a company and their legal representatives to collaborate and prepare H-1B registrations, H-1B petitions, and associated requests for premium processing.\nPetitioners will continue to have the option of filing a paper Form I-129 H-1B petition and any associated Form I-907 if they prefer. However, during the initial launch of organizational accounts, users will not be able to link paper-filed Forms I-129 and I-907 to their online accounts.\nAlert: H-1B petitions can be portable from one job to another. For information about petitioning for a beneficiary in valid H-1B nonimmigrant status and when they may begin new H-1B employment, regardless of whether they are currently employed or have been terminated, click on “Changing Employers or Employment Terms with the Same Employer (Portability)” below. For more information, including options for H-1B beneficiaries who have been terminated, visitOptions for Nonimmigrant Workers Following Termination of Employment.\nThis nonimmigrant classification applies to people who wish to perform services in a specialty occupation, services of exceptional merit and ability relating to a Department of Defense (DOD) cooperative research and development project, or services as a fashion model of distinguished merit or ability.\nThe occupation requires:\nThe position must also meet one of the following criteria to qualify as a specialty occupation:\nFor you to qualify to perform services in a specialty occupation you must meet one of the following criteria:\nHave education, specialized training, and/or progressively responsible experience that is equivalent to the completion of a U.S. bachelor’s or higher degree in the specialty occupation, and have recognition of expertise in the specialty through progressively responsible positions directly related to the specialty.**\nYes. The prospective petitioner must include a Form ETA-9035/9035E, Labor Condition Application (LCA) certified by the Department of Labor (DOL), with the Form I-129, Petition for a Nonimmigrant Worker. See theDOL’s Office of Foreign Labor Certification.\nFor more information see theInformation for Employers and Employeespage.\nH-1B2\nDOD Researcher and Development Project Worker\nThe job must require a bachelor’s or higher degree, or its equivalent, to perform the duties. The petition must be accompanied by:\nTo be eligible for this classification you must have a bachelor's or higher degree or its equivalent in the occupational field in which you will be performing services. This requirement can be met based on one of the following criteria:\nH-1B3\nFashion Model\nThe position/services must require a fashion model of prominence.\nTo be eligible for this visa category you must be a fashion model of distinguished merit and ability.\n*For more information, see 8 CFR §214.2(h)(4)(iii)(A). “Normally,” “common,” and “usually” are interpreted based on their plain language, dictionary definitions. They are not interpreted to mean “always.”\n**For more information see 8 CFR §214.2(h)(4)(iii)(C).\nSome professions require an H-1B beneficiary to hold a state or local license authorizing the beneficiary to fully practice the specialty occupation.\nIf an occupation in the state of intended employment requires such a license, an H-1B beneficiary seeking classification in that occupation generally must have that license before the petition is approved, rather than at the time of filing the petition. See8 CFR 214.2(h)(4)(v)(A)–(B). When a license is required, but there is no evidence of the beneficiary holding one, USCIS will generally issue a request for evidence of the required license.\nIn 2020, we implemented an electronic registration process for the H-1B cap. A cap-subject H-1B petition will not be considered to be properly filed unless it is based on a valid, selected registration for the same beneficiary and the appropriate fiscal year, unless the registration requirement is suspended. For more information about the H-1B registration process, visit ourH-1B Electronic Registration Processwebpage.\nStep 1:(only required for specialty occupation and fashion model petitions): Employer/Agent Submits LCA to DOL for Certification.The employer/agent must apply for and receive DOL certification of an LCA. For further information regarding LCA requirements and DOL's process, see theForeign Labor Certification, Department of Laborpage.\nStep 2:Employer/Agent Submits Completed Form I-129 to USCIS.The employer/agent should file Form I-129, Petition for a Nonimmigrant Worker, at the correct location or online.  Please see ourI-129 Direct Filing Chartpage. The DOL-certified LCA should be submitted with the Form I-129 (only for specialty occupation and fashion models). See theinstructions to the Form I-129(PDF, 987.49 KB)for additional filing requirements.\nStep 3:Prospective Workers Outside the United States Apply for Visa and/or Admission.Once the Form I-129 petition has been approved, the prospective H-1B worker who is outside the United States may apply with the U.S. Department of State (DOS) at a U.S. embassy or consulate abroad for an H-1B visa (if a visa is required). Regardless of whether a visa is required, the prospective H-1B worker must then apply to U.S. Customs and Border Protection (CBP) for admission to the United States in H-1B classification.\nProspective specialty occupation and distinguished fashion model employers/agents must obtain a certification of an LCA from the DOL. This application includes certain attestations, a violation of which can result in fines, bars on sponsoring nonimmigrant or immigrant petitions, and other sanctions to the employer/agent. The application requires the employer/agent to attest that it will comply with the following labor requirements:\nAs an H-1B specialty occupation worker, you may be admitted for a period of up to 3 years. Your time period may be extended, but generally cannot go beyond a total of 6 years.\nHowever, you may be eligible for an H-1B extension beyond the sixth year under8 CFR 214.2(h)(13)(iii)(E)if you are the beneficiary of an approved immigrant visa petition under the EB-1, EB-2, or EB-3 classifications, and are eligible to be granted that immigrant status but for application of the per country or worldwide limitations on immigrant visas. Petitioners must demonstrate the visa is not available as of the date they file an H-1B petition with USCIS. We may grant extensions on this basis in up to 3-year increments until we make a final decision to revoke the approval of the immigrant visa petition or to approve or deny your application for an immigrant visa or application to adjust status to lawful permanent residence.\nAlternatively, under8 CFR 214.2(h)(13)(iii)(D), you may be eligible for an H-1B extension beyond the sixth year if at least 365 days have passed since a labor certification was filed with the Department of Labor on your behalf (if such certification is required) or an immigrant visa petition was filed with USCIS on your behalf.\nYou are ineligible for this extension beyond the sixth year if you fail to file an adjustment of status application or apply for an immigrant visa within 1 year of an immigrant visa being available. If the accrual of such 1-year period is interrupted by the unavailability of an immigrant visa, you will have a new 1-year period after an immigrant visa again becomes immediately available, during which you generally must file an adjustment of status application or apply for an immigrant visa. We may, in our discretion, excuse a failure to file an adjustment of status application or apply for an immigrant visa within 1 year of an immigrant visa being available if your employer establishes that the failure to apply was due to circumstances beyond your control. When considering whether to excuse a failure to timely file within 1 year, we will look at the totality of the circumstances, which may include:\nWe may excuse a failure to timely file in cases of both voluntary and involuntary change of employment when considering the totality of the circumstances. We may grant extensions under this provision in up to 1-year increments until the approved permanent labor certification expires or  a final decision has been made to:\nYour employer will be liable for the reasonable costs of your return transportation if they terminate your employment before the end of your period of authorized stay. Your employer is not responsible for the costs of your return transportation if you voluntarily resign from your position. For more information, please seeOptions for Nonimmigrant Workers Following Termination of Employment.\nThe H-1B classification has an annual numerical limit (cap) of 65,000 new statuses/visas each fiscal year. An additional 20,000 petitions filed on behalf of beneficiaries with a master’s degree or higher from a U.S. institution of higher education are exempt from the cap. Additionally, H-1B workers who are petitioned for or employed at an institution of higher education or its affiliated or related nonprofit entities, a nonprofit research organization, or a government research organization, are not subject to this numerical cap.\nFor further information about the numerical cap, see ourH-1B Cap Season page.\nChanging Employers\nWhen can I begin working for a new H-1B employer if I change employers?\nWill I still have employment authorization if I change employers?\nCan I move from cap-exempt to cap-subject employment?\nChanging Employment Terms with the Same Employer\nWhat if I want to start new employment or change employment terms with my current employer?\nYour spouse and unmarried children under 21 years of age may seek admission in the H-4 nonimmigrant classification. Certain H-4 dependent spouses of H-1B nonimmigrants can file Form I-765, Application for Employment Authorization, as long as the H-1B nonimmigrant has already started the process of seeking employment-based lawful permanent resident status. Please visit ourEmployment Authorization for Certain H-4 Dependent Spousespage to learn more.\nUSCIS.gov\nAn official website of theU.S. Department of Homeland Security"
    },
    {
        "source": "bechtel.stanford.edu.txt",
        "content": "See the latest guidance on travel posted by the Bechtel International Center.Learn more.\nLog into our immigration portal\nThe F-1 and J-1 visas are the only student visas used at Stanford University.\nMost students study with an F-1 visa. Not all students qualify for the J-1 visa. Stanford policy prohibits your using a J-1 visa if you are funded more than 50 percent by personal or family funds. You qualify for either an F-1 or J-1 visa when you receive a 50 percent research assistantship (RA), teaching assistantship (TA),  or fellowship from Stanford University.\nTo apply for an F-1 or J-1 visa stamp, you must first obtain an I-20 form (for F-1) or DS-2019 form (for J-1). These forms are issued by Bechtel International Center. You must include them in your application when you apply for your F-1 or J1 visa stamp at a U.S. consulate or embassy.\nKeep in mind these important points when you apply for an F-1 or J-1 student visa:\nF-1 Visa\nJ-1 Visa\nEmployment Opportunities\nOn-Campus Employment Before\nGraduation\nOff-Campus Employment Before\nGraduation\nOff-Campus Employment After\nGraduation\nPost-Completion Practical Training - total of 12 months, (may be limited by time spent in Optional Practical Training prior to graduation)\nAcademic Training (restrictions are the same as those for participation prior to graduation)\nFunding\nProof of Funding\nFunding from personal or family\nincome (including loans)\nUnlimited\nMust be less than 50% of total funding per year\nDependents\nSchool Attendance\nF-2 spouse may only engage in part-time study, and the F-2 child may only engage in full-time study if the study is in an elementary or secondary school (kindergarten through twelfth grade)\nJ-2 dependents may attend school part time or full time\nEmployment of dependents\nNot allowed under any circumstances\nAllowed if dependents can prove their earnings are not needed to support the J-1 visa holder;  Employment authorization is required\nFollowing are additional resources to help you understand F-1 and J-1 visas and associated requirements.\nBechtel International CenterBuilding Hours: Mon - Friday 8:30 a.m. to 4:30 p.m.Student & Scholar Service Hours: 10-12/1-4584 Capistrano Way Stanford,CA94305United States\nBechtel Connect"
    },
    {
        "source": "iss.washington.edu.txt",
        "content": "On This Page:\nThe F-1 or J-1visastamp in your passport is anentrydocument. It is permission to applyto enterthe United States in that visa category. Canadian citizens are not required to have a visa stamp in their passport to enter the U.S.\nThe visa expiration date is separate from your length of authorized stay in the U.S. The visa expiration date is also different from your I-20 or DS-2019 end date. Read more about the “period of authorized stay” and a review of “documents” in ourWhat is F-1 “Status” orWhat is J-1 “Status”section.\nIt is okay toremainin the U.S. after your F-1 or J-1 visa expires as long as:\nThe F-1 or J-1 visa is only necessary forre-entryto the U.S. if you leave. After your visa expires, you must apply for a new F-1 or J-1 visa the next time you travel internationally in orderto returnto the U.S.\nAllowing the visa to expire while in the U.S. does not affect future visa applications nor eligibility for benefits like CPT or OPT.\n(There are some exceptions to this visa validity rule regarding short trips to Canada, Mexico, and the Caribbean islands, except for Cuba. Please check theAutomatic Visa Revalidationsection).\nThe ability to remain in the U.S. is also applicable if your visa has a limited number of entries that have been used, or if you have changed your nonimmigrant status while in the U.S. Review the next section,Automatic Visa Revalidation, for exceptions to the rule requiring a valid visa to enter the U.S.\nIf your visa is still valid, you will not need to renew your visa regardless of the length of time outside the U.S.\nAn exception to the rule requiring a valid, unexpired visa exists for students in F-1 and J-1 status who travel for fewer than 30 days solely to Canada or Mexico or islands in the Caribbean except Cuba. Your visa will be considered to be “extended” to the date of reentry, eliminating the need to obtain a new visa at a U.S. consulate before that particular re-entry. This procedure is known asautomatic visa revalidation.\nWarning:if you apply for a new visa while in Canada, Mexico, or islands in the Caribbean, you will not be able to return to the U.S. if the visa application is denied. Also, citizens of Iran, Sudan, and Syria are not eligible for automatic visa revalidation.\nThe automatic visa revalidation benefit applies to students who changed status within the U.S. and have an F-1 or J-1 approval notice from USCIS. The previous visa type is considered to be “converted” to the F-1 or J-1 for that entry only.\nYou cannot apply for an F-1 or J-1 visa inside the U.S.Visas can only be obtained outside of the U.S. at aU.S. Embassy or Consulate.\nIt is advisable to apply for the visa at a U.S. consulate in your home country, unless circumstances or travel plans make this impossible. It may be possible to apply for a visa at a U.S. consulate in a country other than your home country. This is called a “third country national (TCN)” application. Not all U.S. consulates accept TCN applications, and some allow TCN applications for limited situations; check with individual consulates, including those in Canada and Mexico, for TCN application policies.\nIt can be risky to apply in a country other than your home country.For instance, if you apply for a new visa in Canada and encounter delays, you must remain in Canada for the length of the processing. You will not be able to reenter the U.S. until the new visa is approved.\nAllow ample time for the visa application process. There are always risks of processing delays.Winter and spring breaks are very short, and not ideal for renewing visas.\nU.S. consulates require in-person interviews for most first-time visa applicants. An interview may be waived if you are applying to renew your visa. You are encouraged to schedule the visa interview appointment as early as possible. The U.S. Department of State maintains an excellent website on thevisa application process, and you should study it carefully. You can also find information about how long it will take to get your visa. Students applying for initial-entry F-1 and F-2 visas may be issued the visas up to 120 days before the academic program start date as noted on the I-20. J-1 and J-2 exchange visitors may be issued visas at any time before the beginning of their programs.\nVisa processing delays may occur for a variety of reasons,with enhanced security reviews based on your field of study, country of origin, and the likelihood of returning home after completion of studies. Certain disciplines are considered “sensitive” by the State Department and are put on the Technology Alert List (TAL). The current TAL is not public information. Consult an ISS adviser for more information about potential visa delays.\nRequired documents when applying for a visa:\nAdditional documents may be required when applying for a visa:\nAdditional things to consider when applying for a visa:\nIf you plan to study abroad during your UW degree program, carefully review the entry visa requirements for the country where you will study. You might need a valid F-1 or J-1 U.S. visa to apply for an entry visa to another country while you are a UW student. It is not possible to apply for a new F-1/J-1 visa inside the U.S. If your current U.S. student visa is expired, you might need to travel outside of the U.S. to obtain a new F-1 or J-1 visa before you can apply for a visa to another country. Allow enough time for the required visa applications when planning to study abroad. You should also consult ISS regarding study abroad plans to determine if and how they will affect your F-1 or J-1 status.\n2 days ago\n3 days ago\n1 week ago\n© 2024 University of Washington  |  Seattle, WA"
    },
    {
        "source": "studyinthestates.txt",
        "content": "Official website of the Department of Homeland Security\nOn Nov. 18, 2024, the Institute of International Education (IIE) released its annual Open Doors Report...\nBased on the student type and education level you selected, below is an overview of important information for you to know. This guide includes information about every step in the international student process, from researching a program to graduating and departing the United States.\nIf you want to study in the United States, the first step is to research the school or program that most interests you. The United States has several postsecondary options for F-1 international students, including community colleges and undergraduate- and graduate-level programs. Visit thePrograms of Studypage to learn more about these options.\n\nTraveling to the United States requires that you take certain steps before your arrival. It is also necessary to be prepared and organized when you arrive at the U.S. port of entry. Additional travel information can be found on theGetting to the United Statespage.\n\nWhile studying in the United States, it is important to maintain your status which relates to the purpose or reason for why you want to come to the United States. As an F-1 student, your primary purpose for coming to the United States is to complete a full course of study at an SEVP-certified school. This means you must not take any action that detracts from fulfilling this purpose and follow the regulations associated with studying in the United States. Additional information can be found on theMaintaining Your Statuspage.\n\nWhile studying in the United States, you can apply for certain benefits. These student benefits are not granted by SEVP and require students to apply to other U.S. government agencies to receive them.\n\nIf you want to change the purpose of your visit while in the United States, you (or in some cases, your employer) must file a request with USCIS on the appropriate form before your authorized stay expires. USCIS recommends that you apply as soon as you determine that you need to change to a different nonimmigrant category. If USCIS denies your application, be prepared to leave the United States when your current status expires. Additional information can be found on theChange of Statuspage.\n\nIf you have maintained your status and finished a program of study or your authorized period of post-completion OPT, and you do not transfer to another SEVP-certified school, you have a 60-day grace period to depart from the United States. Failure to depart within this grace period could adversely impact your ability to re-enter the United States under a different nonimmigrant or immigrant classification."
    },
    {
        "source": "isso.ucsf.edu.txt",
        "content": "Present the following documents to U.S. Customs and Border Protection upon re-entry:\nAt the port of entry, your passport will be date stamped and returned to you. Obtain your electronic I-94 form athttps://i94.cbp.dhs.gov/I94/#/home.\nReview theU.S. Embassy or Consulate websitewhere you will apply for your visa for location specific information.\nU.S. consulates and embassies will generally require that you:\nNOTE: Canadian citizens do not need to apply for a visa.\nFor an overview of the F-1 visa application process, please see theU.S. Department of State website.\nInternational Students and Scholars Office\nWilliam J. Rutter Center1675 Owens Street, Room CC290San Francisco, CA 94143\nPhone: (415) 476-1773Email:[email protected]\n​Events\nNews\n\n© 2024 The Regents of the University of California"
    },
    {
        "source": "murthy_h1b_faq.txt",
        "content": "One’s H1B clock is “reset” only if one is outside the US for 365 days AND is the beneficiary of a cap-subject H1B petition (i.e. Filing through the H1B lottery, again.). A petition to recapture unused H1B time does not reset the clock. (05.Dec.2016)\nIn frequent sessions of our Chat, Sheela Murthy and other senior attorneys provide guidance that clarifies the law in real time. For details on chat participation,click here.\nAccess more FAQshere.\n\nCopyright © 2016, MURTHY LAW FIRM. All Rights Reserved\nIn a consultation, an attorney can provide answers to your questions, or you may engage our firm for your immigration process.Learn More\nThe Murthy Law Firm can conveniently and efficiently consult and/or represent clients located anywhere in the United States or abroad on U.S. immigration matters.Hire Us\n\n\n\n\nJacksonville, USA:410.356.5440\nChennai, India:+91.44.4003.5600"
    },
    {
        "source": "state_department_student_visa.txt",
        "content": "Tourism & Visit\nBusiness\nEmployment\nStudy & Exchange\nImmigrate\nOther Visa Categories\nU.S. Visa: Reciprocity and Civil Documents by Country\nShare this page:\nStudent Visa\nExchange Visitor Visa\n\nGenerally, foreign nationals who wish to travel to the United States must first obtain a visa, either a nonimmigrant visa for a temporary stay, or an immigrant visa for permanent residence. You must have a student visa to travel to the United States to study. Your course of study and the type of school you plan to attend determine whether you need an F visa or an M visa.\nGenerally, foreign nationals who wish to travel to the United States must first obtain a visa, either a nonimmigrant visa for a temporary stay, or an immigrant visa for permanent residence. You must have a student visa to travel to the United States to study. Your course of study and the type of school you plan to attend determine whether you need an F visa or an M visa.\nTo enter the United States to attend:You need the following visa category:University or collegeFHigh SchoolPrivate elementary schoolSeminaryConservatoryAnother academic institution, including a language training programVocational or other recognized nonacademic institution, other than a language training programM\nStudents cannot travel on the Visa Waiver Program or with Visitor VisasYou must have a student visa (F or M visa) to travel to the United States to study. You may not study after entering on a visitor (B) visa, unless you are eligible for and have obtained a change of status from USCIS, or through the Visa Waiver Program (VWP), except to undertake recreational (non-credit) study as part of a tourist visit. For more information on the VWP, seeVisa Waiver Program.For short periods of recreational study, a Visitor (B) visa may be appropriateA visitor (B) visa permits enrollment in a short recreational course of study, which is not for credit toward a degree or academic certificate. Learn more aboutVisitor Visas.Study leading to a U.S. conferred degree or certificate is not permitted on a visitor (B) visa, even if it is for a short duration. For example, a student in a distance learning program that  requires a period of time on the institution’s U.S. campus must obtain a student (F or M) visa prior to entering the United States.Student Acceptance at a SEVP Approved SchoolThe first step to studying in the United States is apply to a SEVP-approved school in the United States.  If the SEVP-approved school accepts your enrollment, you will be registered for theStudent and Exchange Visitor Information System (SEVIS)and must pay the SEVIS I-901 fee.  The SEVP-approved school will issue you a Form I-20.  After you receive the Form I-20 and register in SEVIS, you may apply at a U.S. Embassy or Consulate for a student (F or M) visa.  You must present the Form I-20 to the consular officer when you attend your visa interview.If your spouse and/or children will live with you in the United States while you study, they must also enroll in SEVIS, obtain individual Form I-20s from the SEVP-approved school, and apply for a visa (but they do not pay the SEVIS fee).Visit the U.S. Immigration and Customs Enforcement (ICE)Student and Exchange Visitor Program (SEVP)website to learn more about SEVIS and the SEVIS I-901 Fee.Visit the Department of StateEducationUSAwebsite to learn about educational opportunities for undergraduate and graduate study, and an overview of the application process.  You can also visit the DHSStudy in the Statesschool search page to search for SEVP-certified schools.\nStudents cannot travel on the Visa Waiver Program or with Visitor VisasYou must have a student visa (F or M visa) to travel to the United States to study. You may not study after entering on a visitor (B) visa, unless you are eligible for and have obtained a change of status from USCIS, or through the Visa Waiver Program (VWP), except to undertake recreational (non-credit) study as part of a tourist visit. For more information on the VWP, seeVisa Waiver Program.\nFor short periods of recreational study, a Visitor (B) visa may be appropriateA visitor (B) visa permits enrollment in a short recreational course of study, which is not for credit toward a degree or academic certificate. Learn more aboutVisitor Visas.\nStudy leading to a U.S. conferred degree or certificate is not permitted on a visitor (B) visa, even if it is for a short duration. For example, a student in a distance learning program that  requires a period of time on the institution’s U.S. campus must obtain a student (F or M) visa prior to entering the United States.\nStudent Acceptance at a SEVP Approved SchoolThe first step to studying in the United States is apply to a SEVP-approved school in the United States.  If the SEVP-approved school accepts your enrollment, you will be registered for theStudent and Exchange Visitor Information System (SEVIS)and must pay the SEVIS I-901 fee.  The SEVP-approved school will issue you a Form I-20.  After you receive the Form I-20 and register in SEVIS, you may apply at a U.S. Embassy or Consulate for a student (F or M) visa.  You must present the Form I-20 to the consular officer when you attend your visa interview.\nIf your spouse and/or children will live with you in the United States while you study, they must also enroll in SEVIS, obtain individual Form I-20s from the SEVP-approved school, and apply for a visa (but they do not pay the SEVIS fee).\nVisit the U.S. Immigration and Customs Enforcement (ICE)Student and Exchange Visitor Program (SEVP)website to learn more about SEVIS and the SEVIS I-901 Fee.\nVisit the Department of StateEducationUSAwebsite to learn about educational opportunities for undergraduate and graduate study, and an overview of the application process.  You can also visit the DHSStudy in the Statesschool search page to search for SEVP-certified schools.\nThere are several steps to apply for a visa. The order of these steps and how you complete them may vary by U.S. Embassy or Consulate. Please consult the instructions on theembassy or consulate website.Complete the Online Visa ApplicationOnline Nonimmigrant Visa Application,Form DS-160–Learn moreabout completing theDS-160. You must: 1) complete the online visa application, and 2) print the application form confirmation page to bring to your interview.Photo–You will upload your photo while completing the online Form DS-160. Your photo must meet thePhotograph Requirements.\nThere are several steps to apply for a visa. The order of these steps and how you complete them may vary by U.S. Embassy or Consulate. Please consult the instructions on theembassy or consulate website.\nVisa applicants generally require an interview, with certain limited exceptions below. Consular officers may require an interview of any visa applicant.If you are age:Then an interview is:13 and youngerGenerally not required14 - 79Required (some exceptions for renewals)80 and olderGenerally not required\nVisa applicants generally require an interview, with certain limited exceptions below. Consular officers may require an interview of any visa applicant.\nIf you are age:\nThen an interview is:\n13 and younger\nGenerally not required\n14 - 79\nRequired (some exceptions for renewals)\n80 and older\nGenerally not required\nYou should schedule an appointment for your visa interview at theU.S. Embassy or Consulatein the country where you live. You may schedule your interview at another U.S. Embassy or Consulate, but be aware that it may be more difficult to demostrate that you qualify for a visa outside of the country where you live.Wait times for interview appointments vary by location, season, and visa category, so you should apply for your visa early. Review the interview wait time for the location where you will apply:\nYou should schedule an appointment for your visa interview at theU.S. Embassy or Consulatein the country where you live. You may schedule your interview at another U.S. Embassy or Consulate, but be aware that it may be more difficult to demostrate that you qualify for a visa outside of the country where you live.\nWait times for interview appointments vary by location, season, and visa category, so you should apply for your visa early. Review the interview wait time for the location where you will apply:\nCheck the estimated wait time for a nonimmigrant visa interview appointment at a U.S. Embassy or Consulate.\nCheck the estimated wait time for a nonimmigrant visa interview appointment at a U.S. Embassy or Consulate.\nNote:  Please check the individual Embassy or Consulate website to determine if your case is eligible for a waiver of the in-person interview.Applicants scheduling visa appointments in a location different from their place of residence should check post websites for nonresident wait times.\nNote:  Please check the individual Embassy or Consulate website to determine if your case is eligible for a waiver of the in-person interview.\nApplicants scheduling visa appointments in a location different from their place of residence should check post websites for nonresident wait times.\n---\n\nNew Students– Student (F and M) visas for new students can be issued up to 365 days before the start date of a course of study.  However, you will not be allowed to enter the United States on your student visa more than 30 days before the start date.Continuing Students- Student (F and M) visas for continuing students may be issued at any time, as long as the student is currently enrolled at a SEVP-approved school or institution and in SEVIS.  Continuing students may enter the United States at any time before classes start.\nNew Students– Student (F and M) visas for new students can be issued up to 365 days before the start date of a course of study.  However, you will not be allowed to enter the United States on your student visa more than 30 days before the start date.\nContinuing Students- Student (F and M) visas for continuing students may be issued at any time, as long as the student is currently enrolled at a SEVP-approved school or institution and in SEVIS.  Continuing students may enter the United States at any time before classes start.\nFees - Pay the non-refundable visa application fee, if you are required to pay it before your interview. If your visa is approved, you may also pay a visa issuance fee, if applicable to your nationality. Fee information is provided below:\n\n$185\nReview the instructions available on the website of theU.S. Embassy or Consulatewhere you will apply to learn more about fee payment.\nGather and prepare the following required documents before your visa interview:Passportvalid for travel to the United States – Your passport must be valid for at least six months beyond your period of stay in the United States (unless exempt bycountry-specific agreements). Each individual who needs a visa must submit a separate application, including any family members listed in your passport.Nonimmigrant Visa Application,Form DS-160confirmation page.Application fee payment receipt,if you are required to pay before your interview.Photo– You will upload your photo while completing the online Form DS-160. If thephoto upload fails,you must bring one printed photo in the format explained in thePhotograph Requirements.Certificate of Eligibility for Nonimmigrant (F-1) Student Status-For Academic and Language Students, Form I-20 or Certificate of Eligibility for Nonimmigrant (M-1) Student Status for Vocational Students, Form I-20– Your school will send you a Form I-20 once they have entered your information in the SEVIS database. You and your school official must sign the Form I-20.  All students must be registered in the Student and Exchange Visitor System (SEVIS). Your spouse and/or minor children, if they intend live in the United States with you, will each receive an individual Form I-20.\nGather and prepare the following required documents before your visa interview:\nA consular officer will interview you to determine your qualifications for a student visa, and may request additional documents, such as evidence of:Your academic preparation, such as:Transcripts, diplomas, degrees, or certificates from schools you attended; andStandardized test scores required by your U.S. school;Your intent to depart the United States upon completion of the course of study; andHow you will pay all educational, living and travel costs.Review the instructions for how to apply for a visa on the website of theU.S. Embassy or Consulatewhere you will apply.\nA consular officer will interview you to determine your qualifications for a student visa, and may request additional documents, such as evidence of:\nReview the instructions for how to apply for a visa on the website of theU.S. Embassy or Consulatewhere you will apply.\nA consular officer will interview you to determine whether you are qualified to receive a student visa. You must establish that you meet the requirements under U.S. law to receive a visa.Ink-free, digital fingerprint scans are taken as part of the application process. They are usually taken during your interview, but this varies based on location.After your visa interview, the consular officer may determine that your application requires furtheradministrative processing.  The consular officer will inform you if this is required.After the visa is approved, you may need to pay a visa issuance fee (if applicable to your nationality), and make arrangements for the return of the passport and visa to you.  Review thevisa processing timesto learn more.\nA consular officer will interview you to determine whether you are qualified to receive a student visa. You must establish that you meet the requirements under U.S. law to receive a visa.\nInk-free, digital fingerprint scans are taken as part of the application process. They are usually taken during your interview, but this varies based on location.\nAfter your visa interview, the consular officer may determine that your application requires furtheradministrative processing.  The consular officer will inform you if this is required.\nAfter the visa is approved, you may need to pay a visa issuance fee (if applicable to your nationality), and make arrangements for the return of the passport and visa to you.  Review thevisa processing timesto learn more.\nA visa does not guarantee entry into the United States.  A visa only allows a foreign citizen to travel to a U.S. port-of-entry (generally an airport) and request permission to enter the United States. The Department of Homeland Security (DHS), U.S. Customs and Border Protection (CBP) officials at the port-of-entry have authority to permit or deny admission to the United States.After you present your passport, visa, and Form I-20 at the port-of-entry, a CBP official will make this decision.  Upon admission, the CBP official will provide an admission stamp or paper Form I-94, Arrival/Departure Record.Learn about procedures for students (with F or M visas) entering the United States on the CBP website underArrival Procedures for Students or Exchange Visitors.  Learn about admissions and entry requirements, restrictions about bringing food, agricultural products, and other restricted/prohibited goods, and more by reviewing theCBP website.\nA visa does not guarantee entry into the United States.  A visa only allows a foreign citizen to travel to a U.S. port-of-entry (generally an airport) and request permission to enter the United States. The Department of Homeland Security (DHS), U.S. Customs and Border Protection (CBP) officials at the port-of-entry have authority to permit or deny admission to the United States.\nAfter you present your passport, visa, and Form I-20 at the port-of-entry, a CBP official will make this decision.  Upon admission, the CBP official will provide an admission stamp or paper Form I-94, Arrival/Departure Record.\nLearn about procedures for students (with F or M visas) entering the United States on the CBP website underArrival Procedures for Students or Exchange Visitors.  Learn about admissions and entry requirements, restrictions about bringing food, agricultural products, and other restricted/prohibited goods, and more by reviewing theCBP website.\nForeign students in the United States with F visas must depart the United States within 60 days after the program end date listed on Form I-20, including any authorized practical training.Foreign students may request an extension through U.S. Citizenship and Immigration Services (USCIS) website (see the USCISExtend Your Staypage). Additional information to maintain student status is on the U.S. Immigration and Customs Enforcement SEVP website underMaintaining Your Immigration Status While a Student or Exchange Visitor.Failure to depart the United States on time will result in beingout of status. Under U.S. law, visas of individuals who are out of status are automatically voided (Section 222(g) of the Immigration and Nationality Act).  Any multiple entry visa that was voided due to being out of status will not be valid for future entries into the United States.Failure to depart the United States on time may also result in you being ineligible for visas in the future in certain cases. ReviewVisa DenialsandIneligibilities and Waivers: Lawsto learn more.\nForeign students in the United States with F visas must depart the United States within 60 days after the program end date listed on Form I-20, including any authorized practical training.\nForeign students may request an extension through U.S. Citizenship and Immigration Services (USCIS) website (see the USCISExtend Your Staypage). Additional information to maintain student status is on the U.S. Immigration and Customs Enforcement SEVP website underMaintaining Your Immigration Status While a Student or Exchange Visitor.\nFailure to depart the United States on time will result in beingout of status. Under U.S. law, visas of individuals who are out of status are automatically voided (Section 222(g) of the Immigration and Nationality Act).  Any multiple entry visa that was voided due to being out of status will not be valid for future entries into the United States.\nFailure to depart the United States on time may also result in you being ineligible for visas in the future in certain cases. ReviewVisa DenialsandIneligibilities and Waivers: Lawsto learn more.\nIf your plans change while in the United States (for example, you marry a U.S. citizen or receive an offer of employment), you may be able to request a change in your nonimmigrant status to another category through U.S. Citizenship and Immigration Services (USCIS). SeeChange My Nonimmigrant Statuson the USCIS website to learn more.While you are in the United States, receiving a change of status from USCIS does not require you to apply for a new visa.  However, once you depart the United States you must apply for a new visa at a U.S. Embassy or Consulate in the appropriate category for your travel.\nIf your plans change while in the United States (for example, you marry a U.S. citizen or receive an offer of employment), you may be able to request a change in your nonimmigrant status to another category through U.S. Citizenship and Immigration Services (USCIS). SeeChange My Nonimmigrant Statuson the USCIS website to learn more.\nWhile you are in the United States, receiving a change of status from USCIS does not require you to apply for a new visa.  However, once you depart the United States you must apply for a new visa at a U.S. Embassy or Consulate in the appropriate category for your travel.\nThere is no guarantee you will be issued a visa. Do not make final travel plans or buy tickets until you have a visa.For information about working in the United States during your study, reviewStudents and Employmentand Form I-765Work Authorization Instructionson the USCIS website.If you have a temporary break in your study, view the information on the SEVP website underDo Students Returning from Temporary Absences Need New Visas?If your student visa is still valid, but you are outside the United States, you should consult with your Designated School Officials.Spouse and childrenYour spouse and unmarried, minor children who intend to reside with you during your study may apply for F-2 or M-2 visas. Although SEVIS fee payment is not required, your school must issue them an individual Form I-20, which is required to apply for their visas. You must provide a copy of your F-1 or M-1 visa and provide proof of relationship.Your minor children are permitted to attend school in the United States while accompanying you.U.S. Embassies and Consulates adjudicate visa applications for same-sex spouses in the same way that we adjudicate applications for opposite gender spouses.A valid U.S. visa in an expired passport is still valid. Unless canceled or revoked, a visa is valid until its expiration date. If you have a valid visa in your expired passport, do not remove it from your expired passport. You may use your valid visa in your expired passport along with a new valid passport for travel and admission to the United States.\nStudents on F or M visas are not permitted to enter the United States earlier than 30 days before the start date of their program.  If you wish to enter earlier than 30 days before your start date, you must separately apply and qualify for a visitor (B) visa.\nAfter you are admitted to the United States by U.S. Customs and Border Protection (CBP) officials in visitor (B) visa status, you must separately apply to U.S. Citizenship and Immigration Services (USCIS) for achange of statusto student (For M) status prior to the start of your program.  You may not begin your course of study until the change of status is approved, and you may encounter lengthy processing times.  You may also depart the United States and re-enter on your student (F or M) visa.\n\nStudents who are authorized Optional Practical Training (OPT) must have a Form I-20 endorsed for OPT and must apply to USCIS for an Employment Authorization Document (EAD).  OPT is temporary employment that is directly related to the eligible F-1 student's area of study. To learn more about OPT, please visit theUSCIS Websiteand theICE International Studentswebpage.\nThere are restrictions on students in F-1 nonimmigrant status attending public school in the United States. SeeForeign Students in Public Schoolsto learn more.\nWhether you are applying for the first time or renewing your visa, you will use the same application process (please reviewHow to Apply, above).\nReviewVisa Denialsfor detailed information about visa ineligibilities, denials, and waivers.\nYou may reapply if you believe you have additional evidence of your qualifications for a student (F or M) visa, or you believe your circumstances have changed. ReviewVisa Denialsto learn more.\nAttempting to obtain a visa by the willful misrepresentation of a material fact, or fraud, may result in the permanent refusal of a visa or denial of entry into the United States.\nReviewIneligibilities and Waivers: Laws.\nCitizens of Canada and Bermuda generally do not require visas to enter the United States as students, although they must present a valid Form I-20 at the time of admission. For more information seeinformation for Citizens of Canada and Bermuda.\nAdditional resources for Canadian visitors to the United States can be found on theU.S. Embassy and Consulate websites in Canada.\nA-Z IndexLost/Stolen Travel DocumentsDenialsSEVIS-ICEDHS-Study in the StatesVisa Expiration DateAutomatic RevalidationNonimmigrants in the United States–Applying for Visas in Canada or MexicoFind a U.S. Embassy or ConsulateStudent Advising CenterVisa Applicants - State Sponsors of TerrorismCustomer Service Statement\nStudent Visa\nExchange Visitor Visa\nYou are about to leave travel.state.gov for an external website that is not maintained by the U.S. Department of State.\nLinks to external websites are provided as a convenience and should not be construed as an endorsement by the U.S. Department of State of the views or products contained therein. If you wish to remain on travel.state.gov, click the \"cancel\" message.\nYou are about to visit:\n\nCancelGO"
    },
    {
        "source": "h1b_handbook.txt",
        "content": "H-1B status is used at the University of Denver to temporarily employ non-immigrants in faculty, staff,\nand post-doctoral positions. United States Citizenship and Immigration Services (USCIS) limits the H-1B\nvisa to use in \"specialty occupations\" that require the theoretical and practical application of a body of\nhighly specialized knowledge.\nEligibility for H-1B Category\nNon-immigrant candidates for a position at DU may be considered for employment in the H-1B category\nat the University under the following conditions:\n\nThe appointment will be long-term or possibly permanent.\n\nThe position requires at least a Bachelor's degree in a specific specialty.\n\nThe candidate holds at least a Bachelor's degree or the foreign equivalent in a relevant field.\n\nJ-1 exchange visitor status is disadvantageous or not appropriate.\n\nThe candidate is not subject to the J-1 2-Year Home Residency requirement.\n\nThe department will pay at least the prevailing wage determined by the State Workforce Agency\n(SWA).\n* All non-immigrants with regular tenure-track faculty appointments must eventually obtain U.S.\npermanent residency status.\nFiling an H-1B Petition\nDepartments may work with International Student and Scholar Services (ISSS) to file an H-1B petition on\na candidate's behalf. If you file the petition through ISSS, the only fees required are the USCIS filing fee\n($325) and an additional fraud detection and prevention fee ($500) for new H-1B employment at the\nUniversity.\nMost H-1B petitions will be processed by ISSS unless there are exceptional circumstances that warrant\nretaining outside legal counsel. ISSS has discretion over which cases it may wish to refer to outside\ncounsel. Using an immigration attorney to file an H-1B petition can cost between $1500 and $3500 per\napplication. Legal fees are the responsibility of the hiring department and should not be passed on to\nthe candidate.\nDepartment Responsibilities\nBy agreeing to sponsor a non-immigrant for H-1B status at the University, a department assumes the\nfollowing responsibilities:\n\nPay the higher of the actual wage or the prevailing wage.\n\nPost the Labor Condition Application (LCA).\n\nPay the relevant USCIS filing fees.\n\nTrack the number of hours the employees works each day and each week for part-time\nemployees.\n\nProvide the employee return transportation if the H-1B employment is terminated prior to the\nexpiration of the H-1B status.\n\nNotify ISSS if the employee leaves prior to the expiration of the H-1B status.\n\nNotify ISSS when there are substantive changes to the position, such as change in job duties or\nlocation of employment.\nApplication Process\nApplicants for H-1B status may not begin employment at the University while the petition is in process,\nexcept in the case of Extension of Status or Portability petitions. The employee may not be placed on\npayroll until the H-1B petition has been approved. United States Citizenship and Immigration Services\n(USCIS) estimates the average processing time to be 30 - 120 days.\nRequest for Filing an H-1B Petition\nTo begin the H-1B petition process, the department must submit the following documents to\nInternational Student and Scholar Services (ISSS):\n\nH-1B Request Form\n\nH-1B Memo\n\nCopy of the job announcement or advertisement\n\nActual Wage Form\n\nAll documents requested from the current/prospective employee\nApplication Overview\nStep 1 - Determining the Prevailing Wage\nAvg. time to completion: 1 - 15 days\nUsing information provided by the department, ISSS requests a prevailing wage determination from the\nColorado State Workforce Agency (SWA). The prevailing wage is the current rate for employees in\nsimilar positions in the same geographical area. In determining the prevailing wage, the actual wage\nmust also be determined. The actual wage is the amount the department is currently paying other\nemployees with an equivalent title, job responsibilities, and experience. The wage offered to the\nprospective employee must be the higher of the prevailing wage or the actual wage.\nIf the wage offered to the employee is lower than the prevailing wage, the department has three\noptions:\n\nIncrease the wage to meet the prevailing wage\n\nWithdraw the offer of employment\n\nRequest a wage survey\nA wage survey uses an alternate source of wage data to determine the prevailing wage. These data are\nprovided by outside organizations for a fee. The results of the prevailing wage from the wage survey are\nnot guaranteed to be lower than the state-determined rate. In the case of an investigation by the\nDepartment of Labor, this wage may be challenged.\nStep 2 - Posting the Labor Condition Application (LCA)\nAvg. time to completion: 1 day to file, 10 days to post\nThe Labor Condition Application (LCA) is an application to the U.S. Department of Labor (DOL) in which\nthe University agrees to several conditions regarding wage, working conditions and notification of filing.\nIf the LCA is certified by the DOL, Form I-129 may be filed. If the LCA is denied, any errors must be\ncorrected and the application resubmitted for evaluation.\nThe department must post copies of the LCA in two prominent locations for ten consecutive business\ndays, then return them to ISSS. Our office will forward the required forms for posting the LCA to the\ndepartment. The positing is not to solicit additional applications for the position, but instead to give\npublic notice of the department's intention to hire a foreign employee, giving aggrieved parties an\nopportunity to respond.\nStep 3 - Submitting Form I-129 (Petition for a Non-Immigrant Worker)\nAvg. time to completion: 30 - 120 days\nOnce the LCA has been approved and posted, Form I-129 may be filed with USCIS. Form I-129 requests\npermission for the University to hire or extend the H-1B status of an employee. The department must\npay the application fee ($320) to USCIS by entering a transaction in Banner (Vendor ID: DHS). When\nentering the transaction, choose the California location for DHS, indicate an enclosure, and forward the\nDirect Pay Cover Sheet to ISSS. For new H-1B employment at the University, the department must also\npay an additional fee ($500) for a fraud detection and prevention check. This fee is paid separately from\nthe filing fee for Form I-129.\nNotification of USCIS Action\nUSCIS will notify ISSS directly regarding the status of H-1B petitions. If the petition is approved, USCIS\nwill send Form I-797, Notice of Action, to us. We will then notify you that the approval notice is ready to\nbe picked up. We strongly recommend collecting the approval notice in person, rather than using\ncampus mail, in order to avoid losing the document.\nIf USCIS requires additional information to adjudicate the petition, they will send an RFE (Request for\nFurther Evidence) to ISSS outlining the information needed before a decision can be made. RFE's are\nsent for a number of reasons, including missing documents, unclear or vaguely worded job descriptions,\nand questions about the applicant's lawful immigrant status in the United States. A decision is generally\nreceived within 30 - 60 days of responding to the RFE.\nCommencing H-1B Employment\nOnce Form I-797, Notice of Approval, has been received, a non-immigrant employee may begin work at\nthe University. Depending on where the employee is currently located, additional action may be\nrequired before H-1B status has been acquired.\nIn addition to the standard I-9 hiring and verification process, a new H-1B employee must also make an\nappointment to meet with Laura Buhs, International Scholar Advisor, prior to beginning employment. To\nmake an appointment, please email Laura at lbuhs@du.edu.\nInitial Employment for Employee in the United States\nOnce ISSS has received the approval notice for an employee, the University may lawfully employee him\nor her. We will notify both the department and the employee that the petition has been approved and a\nnew I-94 card has been received. The I-94 card establishes the employee's legal presence in H-1B status\nin the United States and must be collected. The approval notice will be provided to the employee to\ndocument that he or she is in H-1B status and eligible to work for DU.\nInitial Employment for Employee outside the United States\nOnce the H-1B petition has been approved, USCIS will send an approval notice to ISSS and notify the U.S.\nembassy or consular office designated in the petition. The department must collect the approval notice\nfrom ISSS and forward it to the employee. The employee must apply for an H-1B entry visa, and if\ngranted, enter the United States in H-1B status. For more information about applying for entry visas,\nplease visit the Department of State's travel website.\nExtension of Current Employment at DU\nOnce the H-1B petition has been approved, USCIS will send an approval notice to ISSS. We will notify\nboth the department and the employee that the approval notice has been received and is ready to pick\nup. The employee does not need to meet with an advisor prior to commencing the new period of\nemployment in H-1B status.\nRestrictions and Portability of H-1B Employment\nMaximum Validity\nH-1B status is limited to a maximum total duration of six years. H-1B status is available in increments of\nup to three years. The position is governed by the duration, rate of pay, worksite, and title listed in the\nLabor Condition Application (LCA). H-1B employees do not have a grace period following the termination\nof employment. Valid status ends on the end date listed in the approved H-1B petition, or when the\nemployee is no longer employed in an H-1B position.\nDual Intent\nAlthough H-1B status is designed to temporarily employ professionals, it carries a provision for dual\nintent, which allows an employee to work while intending to become a U.S. permanent resident. Obtain\npermanent residency is a lengthy process; acquiring H-1B status is therefore normally recommended to\ninitial employees who have been offered a tenure-track position while permanent residency is sought. In\nsome cases, other non-immigrant visa status may be appropriate for employment at the University.\nPart-Time Employment\nThe University may file a petition to hire an H-1B employee part-time. The request for part-time\nemployment must be specified in the initial petition, and the University is obligated to track the number\nof hours the employee works each day and each week. The department is responsible for monitoring\nthe employee's hours while employed at DU.\nPortability\nH-1B regulations permit an employer to place an employee who currently holds or who has held H-1B\nstatus on payroll once USCIS has received form I-129. However, this provision does not guarantee that\nthe petition will be approved. If the petition is denied, the employee must stop working when notice of\ndenial is received.\nDependents\nIf the employee is already in the United States and is filing for a change of status to H-1B or is requesting\nan extension of current H-1B status, his or her dependents must also petition to change to H-4\ndependent status. Dependents are defined as a spouse or an unmarried minor child under the age of 21.\nDependents who currently hold another non-immigrant status independent of the employee, or who\nare eligible to hold another non-immigrant status, do not need to file for a change to H-4 status.\nApplying for a Change of Status\nTo change a dependent's status, ISSS must submit Form I-539, Application to Extend/Change Non-\nImmigrant Status, to USCIS with the employee's H-1B petition. The employee or dependent should\ncomplete Form I-539 and submit it to ISSS. The employee must pay the USCIS filing fee for each change\nof status petition submitted ($300) for his or her dependents. If the dependents are not currently in the\nUnited States, they must apply for an H-4 entry visa at a U.S. embassy or consulate prior to entering the\ncountry.\nDependents Studying in the United States\nChildren of H-1B employees working at DU may attend public school or enroll in university courses while\nholding valid H-4 status. However, once the child reaches the age of 21, he or she must acquire another\nnon-immigrant status to continue studying in the United States. If the child is attending DU, he or she\nshould meet with an international student advisor to discuss which immigration status would be\nappropriate to change to in order to remain in the country. If the child is enrolled at another school or\nuniversity, he or she should meet with an international student advisor there to discuss the change of\nstatus process.\nTravel\nH-1B employees may leave the United States and re-enter at any time during their employment,\nprovided they have maintained their immigration status and present the appropriate documents at the\nPort of Entry.\nDocumentation for Port of Entry\nWhen re-entering the United States, the employee should have the following documents:\n\nValid passport\n\nValid H-1B visa, unless otherwise exempt\n\nOriginal Form I-797 Notice of Approval\nA valid H-1B visa is not required when re-entering the United States from Canada or Mexico after a trip\nof 30 days or less.\nVisa Renewal\nIf the employee's visa has expired, he or she must apply for a new one at a U.S. embassy or consular\noffice outside the United States. The employee does not need to apply for a new visa when re-entering\nthe United States from Canada or Mexico after a trip of 30 days or less, provided they have not applied\nfor a new visa abroad and are not nationals of countries designated as state sponsors of terrorism by the\nDepartment of State. After traveling to Mexico or Canada, the entry visa is automatically revalidated by\nimmigration officials at the Port of Entry.\n"
    }
]